package com.mufcryan.anabstract.repository

import com.google.gson.reflect.TypeToken
import com.mufcryan.anabstract.common.bean.ArticleBean
import com.mufcryan.base.BaseRepository
import com.mufcryan.base.bean.BaseResponse
import com.mufcryan.util.GsonUtil

class ArticleRepository: BaseRepository<String, BaseResponse<ArticleBean>>() {
  companion object {
    const val TEST_JSON = "{\n" +
        "    \"data\": {\n" +
        "        \"id\": \"1\",\n" +
        "        \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "        \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。　　一、着重抓好顶层制度设计，形成坚实支撑　　先后出台了《宁夏回族自治区节能降耗与循环经济“十三五”发展规划》《宁夏回族自治区“十三五”节能减排综合工作方案》《宁夏回族自治区打赢蓝天保卫战三年行动计划》《宁夏回族自治区2018-2020年煤炭消费总量控制工作方案》《宁夏回族自治区关于进一步加强能耗“双控”工作推动高质量发展实施方案》等一系列政策措施。修订了《宁夏回族自治区实施<中华人民共和国节约能源法>办法》，制定发布了《宁夏用能单位能耗限额指标》等地方节能标准，节能法律法规体系渐趋完善。自治区政府将单位GDP能耗纳入高质量发展指标体系，将年度能耗“双控”目标纳入国民经济社会发展年度计划，建立了区、市、县（区）三级节能目标管理体系，将节能目标完成情况作为地方各级人民政府领导班子和领导干部任期内的重要考核内容，纳入政府绩效考核体系，实行问责和“一票否决制”。　　二、着重抓好结构优化调整，形成产业基础　　注重加快调整产业结构，实施了中国制造2025宁夏行动纲要，严格控制铁合金、电石电等高耗能行业新增产能。实施了传统产业升级和新兴产业提速工程，累计化解过剩产能773万吨，淘汰落后产能807万吨。注重发展先进装备制造、现代纺织、电子制造、特色消费品等低能耗产业，围绕重点产业补链、延链、强链，推进产业向绿色、高端、集群方向发展，全区三次产业结构优化调整为7.5：42.3：50.3。注重优化能源结构，以创建国家新能源综合示范区为契机，加快发展光伏、风电等新能源产业，截至2019年年底，全区新能源装机规模达2034万千瓦，占总装机约38.4%，较2015年提高2.6个百分点，全区可再生能源电量占全社会用电量的25.8%，可再生能源占能源消费总量的比重达到10.9%。注重严格节能审查制度，出台了《自治区固定资产投资项目节能审查管理办法》，严格执行固定资产投资项目节能评估和审查制度，强化能耗前置控制；将固定资产投资项目节能审查纳入在线审批监管平台管理，实现“不见面”办理。逐步健全工作机制，实现“事前有审查”、“事中事后有监管”，对没有通过能评验收的项目，一律不允许投产，实现项目能耗的闭环管理。　　三、着重抓好重点领域节能，形成重点突破　　注重抓好工业领域节能，出台了《自治区工业绿色发展行动方案（2019-2022年）》，推进工业绿色制造体系建设，累计建设国家和自治区级绿色园区8家、绿色工厂42家、绿色产品4个。实施“工业对标提升十大行动”累计完成1046家工业企业对标任务，认定对标标杆企业64家。加快实施重大节能技改项目，全区电解铝、火力发电等重点耗能产品单耗持续下降。注重实施建筑节能，出台了《宁夏建筑产业化“十三五”规划》《宁夏绿色建筑发展条例》等政策文件。开展了全区绿色建筑行动，新建建筑节能标准执行率达到100%，累计完成既有建筑节能改造约2350万平方米。积极推广装配式建筑和可再生能源建筑应用，实施22项可再生能源建筑应用试点示范项目。开展了绿色建材评价标识工作，发布17个绿色建材产品目录公告，鼓励建设单位在绿色建筑工程中优先采用绿色建材。注重开展交通节能，出台了《贯彻落实<推进运输结构调整三年行动计划（2018-2020年）>实施方案》，实施了石嘴山富海物流集装箱公铁海多式联运示范工程和银川公铁物流园多式联运项目，2019年，全区完成铁路货运量8151万吨，较2017年增长24.8%。开展了绿色交通建设，银川至百色高速公路宁东至甜水堡段项目被交通运输部列为第三批绿色公路建设典型示范工程。开展了“车、船、路、港”千家企业低碳交通运输专项行动，鼓励发展新能源等节能环保的新型运力。开展了新能源交通体系建设，全区道路运输行业天然气、双燃料及新能源汽车达到2.59万辆。开展了集约高效综合交通运输体系建设，推广甩挂运输等先进组织模式，提高多式联运比重。注重推进公共机构节能，制定了《宁夏公共机构节约能源资源“十三五”规划》，重点抓好机关、学校、医院等重点机构的节能工作，开展了节约型公共机构示范单位创建和能效领跑者遴选工作，累计创建节约型示范单位115家。全区公共机构人均综合能耗、单位建筑面积能耗等各项指标均超额完成目标任务。　　四、着重抓好工作责任落实，形成工作合力　　注重强化重点用能单位和重点用能设备管理，开展了重点用能单位“百千万行动”，对重点用能单位实行能耗“双控”目标责任管理，督促企业加强节能管理，提高能源利用效率。加强重点用能设备管理，加大淘汰落后燃煤锅炉力度，推动锅炉系统安全节能标准化管理。开展了电力需求侧管理工作，全区1048户企业安装终端监测设备21628套，推动企业绿色改造升级，降低了用电成本。注重落实节能支持政策，自治区财政每年安排各类节能资金4亿元左右，通过担保贷款、贷款贴息、工业调控等手段放大资金使用效能，有效推动淘汰落后产能、节能技术改造等各类节能工作。施行了国家差别电价和惩罚性电价政策，对电解铝、电石、铁合金等8个行业实行差别电价政策；对能源消耗超过单位产品能源（电耗）限额标准的企业实行惩罚性电价；对钢铁、水泥、电解铝等行业落实阶梯电价政策。全区各市、县（区）已全面实施居民生活阶梯电价和阶梯气价政策。注重加大节能监督检查力度，实现了地级市、重点工业县（区）节能监察机构全覆盖，建立了区、市、县三级节能监察执法体系。开展了节能执法监察，每年都组织对重点行业、重点工业企业开展重大工业节能专项监察，通过节能监察促进企业节能。注重夯实节能管理基础，开展了企业能源统计的业务培训，编制并推广了企业能源统计电子台帐，率先实施对市、县（区）两级按季度核算公布能耗“双控”指标。制定了《宁夏用能单位能源审计报告编制与评审技术规范》等文件，开展了能源计量监督审查，对列入国家“百千万”行动的重点用能单位进行能源计量监督抽查。每年组织开展节能技术培训、节能宣传周主题日活动、绿色出行能源紧缺体验日、节能降耗进企业行动、节能绿色建筑行动等宣传培训活动，形成了全社会参与节能的浓厚氛围。\",\n" +
        "        \"date\": \"发布时间：2020/06/27\",\n" +
        "        \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\",\n" +
        "        \"summary\": {\n" +
        "            \"abstract\": \"宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "            \"wordCloud\": [\n" +
        "                {\n" +
        "                    \"word\": \"宁夏\",\n" +
        "                    \"weight\": 5\n" +
        "                },\n" +
        "                {\n" +
        "                    \"word\": \"发展\",\n" +
        "                    \"weight\": 1\n" +
        "                },\n" +
        "                {\n" +
        "                    \"word\": \"全国\",\n" +
        "                    \"weight\": 1.5\n" +
        "                },\n" +
        "                {\n" +
        "                    \"word\": \"检验\",\n" +
        "                    \"weight\": 2.3\n" +
        "                },\n" +
        "                {\n" +
        "                    \"word\": \"工作\",\n" +
        "                    \"weight\": 3.5\n" +
        "                },\n" +
        "                {\n" +
        "                    \"word\": \"优化\",\n" +
        "                    \"weight\": 4\n" +
        "                },\n" +
        "                {\n" +
        "                    \"word\": \"文明\",\n" +
        "                    \"weight\": 3.1\n" +
        "                },\n" +
        "                {\n" +
        "                    \"word\": \"经济\",\n" +
        "                    \"weight\": 4.5\n" +
        "                },\n" +
        "                {\n" +
        "                    \"word\": \"抓手\",\n" +
        "                    \"weight\": 1.8\n" +
        "                },\n" +
        "                {\n" +
        "                    \"word\": \"进步\",\n" +
        "                    \"weight\": 2\n" +
        "                },\n" +
        "                {\n" +
        "                    \"word\": \"绿色\",\n" +
        "                    \"weight\": 3.6\n" +
        "                },\n" +
        "                {\n" +
        "                    \"word\": \"良性\",\n" +
        "                    \"weight\": 4.2\n" +
        "                }\n" +
        "            ]\n" +
        "        }\n" +
        "    },\n" +
        "    \"status\": 200,\n" +
        "    \"msg\": \"OK\"\n" +
        "}"
  }

  override fun getStrategy() = DataStrategy.NET_GET_ONLY

  override fun getNetData(
    param: String?,
    callBack: RepositoryCallback<BaseResponse<ArticleBean>>?
  ) {
    val type = object : TypeToken<BaseResponse<ArticleBean>>() {}.type
    val response = GsonUtil.getGsonObj<BaseResponse<ArticleBean>>(TEST_JSON, type)
    callBack?.onSuccess(response)

    /*param?.let {
      NetManager.getApi(AbstractApi::class.java)
        .getArticle(it)
        .observeOn(AndroidSchedulers.mainThread())
        .subscribeOn(Schedulers.io())
        .subscribe({ response ->
          if(response.isSuccessful){
            callBack?.onSuccess(response)
          } else {
            callBack?.onFailure(response.status, response.msg)
          }
        }, { throwable ->
          callBack?.onError(throwable)
        })
    }*/
  }
}