package com.mufcryan.anabstract.repository

import com.google.gson.reflect.TypeToken
import com.mufcryan.anabstract.common.bean.ArticlePagingBean
import com.mufcryan.anabstract.net.AbstractApi
import com.mufcryan.base.BaseRepository
import com.mufcryan.base.bean.BasePagingRequest
import com.mufcryan.base.bean.BaseResponse
import com.mufcryan.anabstract.ui.search.SearchPagingRequest
import com.mufcryan.net.NetManager
import com.mufcryan.util.GsonUtil
import io.reactivex.android.schedulers.AndroidSchedulers
import io.reactivex.schedulers.Schedulers

class SearchArticleListRepository: BaseRepository<SearchPagingRequest, BaseResponse<ArticlePagingBean>>() {
  companion object {
    const val TEST_JSON = "{\n" +
        "    \"data\": {\n" +
        "        \"list\": [\n" +
        "            {\n" +
        "                \"id\": \"1\",\n" +
        "                \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "                \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "                \"date\": \"发布时间：2020/06/27\",\n" +
        "                \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"2\",\n" +
        "                \"title\": \"四川省发展改革委调研组专题调研毛尔盖水电站经营情况\",\n" +
        "                \"content\": \"7月10日，省发展改革委副主任、省能源局局长梁武湖，率领省发展改革委、省能源局有关处室负责同志深入中电建水电开发公司专题调研毛尔盖水电站经营情况，指导企业解决电站经营困难问题。\",\n" +
        "                \"date\": \"发布时间：2020/07/17\",\n" +
        "                \"image\": \"https://dimg05.c-ctrip.com/images/100j090000003p8412A22_C_750_375.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"1\",\n" +
        "                \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "                \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "                \"date\": \"发布时间：2020/06/27\",\n" +
        "                \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"2\",\n" +
        "                \"title\": \"四川省发展改革委调研组专题调研毛尔盖水电站经营情况\",\n" +
        "                \"content\": \"7月10日，省发展改革委副主任、省能源局局长梁武湖，率领省发展改革委、省能源局有关处室负责同志深入中电建水电开发公司专题调研毛尔盖水电站经营情况，指导企业解决电站经营困难问题。\",\n" +
        "                \"date\": \"发布时间：2020/07/17\",\n" +
        "                \"image\": \"https://dimg05.c-ctrip.com/images/100j090000003p8412A22_C_750_375.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"1\",\n" +
        "                \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "                \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "                \"date\": \"发布时间：2020/06/27\",\n" +
        "                \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"2\",\n" +
        "                \"title\": \"四川省发展改革委调研组专题调研毛尔盖水电站经营情况\",\n" +
        "                \"content\": \"7月10日，省发展改革委副主任、省能源局局长梁武湖，率领省发展改革委、省能源局有关处室负责同志深入中电建水电开发公司专题调研毛尔盖水电站经营情况，指导企业解决电站经营困难问题。\",\n" +
        "                \"date\": \"发布时间：2020/07/17\",\n" +
        "                \"image\": \"https://dimg05.c-ctrip.com/images/100j090000003p8412A22_C_750_375.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"1\",\n" +
        "                \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "                \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "                \"date\": \"发布时间：2020/06/27\",\n" +
        "                \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"2\",\n" +
        "                \"title\": \"四川省发展改革委调研组专题调研毛尔盖水电站经营情况\",\n" +
        "                \"content\": \"7月10日，省发展改革委副主任、省能源局局长梁武湖，率领省发展改革委、省能源局有关处室负责同志深入中电建水电开发公司专题调研毛尔盖水电站经营情况，指导企业解决电站经营困难问题。\",\n" +
        "                \"date\": \"发布时间：2020/07/17\",\n" +
        "                \"image\": \"https://dimg05.c-ctrip.com/images/100j090000003p8412A22_C_750_375.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"1\",\n" +
        "                \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "                \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "                \"date\": \"发布时间：2020/06/27\",\n" +
        "                \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"2\",\n" +
        "                \"title\": \"四川省发展改革委调研组专题调研毛尔盖水电站经营情况\",\n" +
        "                \"content\": \"7月10日，省发展改革委副主任、省能源局局长梁武湖，率领省发展改革委、省能源局有关处室负责同志深入中电建水电开发公司专题调研毛尔盖水电站经营情况，指导企业解决电站经营困难问题。\",\n" +
        "                \"date\": \"发布时间：2020/07/17\",\n" +
        "                \"image\": \"https://dimg05.c-ctrip.com/images/100j090000003p8412A22_C_750_375.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"1\",\n" +
        "                \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "                \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "                \"date\": \"发布时间：2020/06/27\",\n" +
        "                \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"2\",\n" +
        "                \"title\": \"四川省发展改革委调研组专题调研毛尔盖水电站经营情况\",\n" +
        "                \"content\": \"7月10日，省发展改革委副主任、省能源局局长梁武湖，率领省发展改革委、省能源局有关处室负责同志深入中电建水电开发公司专题调研毛尔盖水电站经营情况，指导企业解决电站经营困难问题。\",\n" +
        "                \"date\": \"发布时间：2020/07/17\",\n" +
        "                \"image\": \"https://dimg05.c-ctrip.com/images/100j090000003p8412A22_C_750_375.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"1\",\n" +
        "                \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "                \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "                \"date\": \"发布时间：2020/06/27\",\n" +
        "                \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"2\",\n" +
        "                \"title\": \"四川省发展改革委调研组专题调研毛尔盖水电站经营情况\",\n" +
        "                \"content\": \"7月10日，省发展改革委副主任、省能源局局长梁武湖，率领省发展改革委、省能源局有关处室负责同志深入中电建水电开发公司专题调研毛尔盖水电站经营情况，指导企业解决电站经营困难问题。\",\n" +
        "                \"date\": \"发布时间：2020/07/17\",\n" +
        "                \"image\": \"https://dimg05.c-ctrip.com/images/100j090000003p8412A22_C_750_375.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"1\",\n" +
        "                \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "                \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "                \"date\": \"发布时间：2020/06/27\",\n" +
        "                \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"2\",\n" +
        "                \"title\": \"四川省发展改革委调研组专题调研毛尔盖水电站经营情况\",\n" +
        "                \"content\": \"7月10日，省发展改革委副主任、省能源局局长梁武湖，率领省发展改革委、省能源局有关处室负责同志深入中电建水电开发公司专题调研毛尔盖水电站经营情况，指导企业解决电站经营困难问题。\",\n" +
        "                \"date\": \"发布时间：2020/07/17\",\n" +
        "                \"image\": \"https://dimg05.c-ctrip.com/images/100j090000003p8412A22_C_750_375.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"1\",\n" +
        "                \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "                \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "                \"date\": \"发布时间：2020/06/27\",\n" +
        "                \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"2\",\n" +
        "                \"title\": \"四川省发展改革委调研组专题调研毛尔盖水电站经营情况\",\n" +
        "                \"content\": \"7月10日，省发展改革委副主任、省能源局局长梁武湖，率领省发展改革委、省能源局有关处室负责同志深入中电建水电开发公司专题调研毛尔盖水电站经营情况，指导企业解决电站经营困难问题。\",\n" +
        "                \"date\": \"发布时间：2020/07/17\",\n" +
        "                \"image\": \"https://dimg05.c-ctrip.com/images/100j090000003p8412A22_C_750_375.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"1\",\n" +
        "                \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "                \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "                \"date\": \"发布时间：2020/06/27\",\n" +
        "                \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"2\",\n" +
        "                \"title\": \"四川省发展改革委调研组专题调研毛尔盖水电站经营情况\",\n" +
        "                \"content\": \"7月10日，省发展改革委副主任、省能源局局长梁武湖，率领省发展改革委、省能源局有关处室负责同志深入中电建水电开发公司专题调研毛尔盖水电站经营情况，指导企业解决电站经营困难问题。\",\n" +
        "                \"date\": \"发布时间：2020/07/17\",\n" +
        "                \"image\": \"https://dimg05.c-ctrip.com/images/100j090000003p8412A22_C_750_375.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"1\",\n" +
        "                \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "                \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "                \"date\": \"发布时间：2020/06/27\",\n" +
        "                \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"2\",\n" +
        "                \"title\": \"四川省发展改革委调研组专题调研毛尔盖水电站经营情况\",\n" +
        "                \"content\": \"7月10日，省发展改革委副主任、省能源局局长梁武湖，率领省发展改革委、省能源局有关处室负责同志深入中电建水电开发公司专题调研毛尔盖水电站经营情况，指导企业解决电站经营困难问题。\",\n" +
        "                \"date\": \"发布时间：2020/07/17\",\n" +
        "                \"image\": \"https://dimg05.c-ctrip.com/images/100j090000003p8412A22_C_750_375.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"1\",\n" +
        "                \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "                \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "                \"date\": \"发布时间：2020/06/27\",\n" +
        "                \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"2\",\n" +
        "                \"title\": \"四川省发展改革委调研组专题调研毛尔盖水电站经营情况\",\n" +
        "                \"content\": \"7月10日，省发展改革委副主任、省能源局局长梁武湖，率领省发展改革委、省能源局有关处室负责同志深入中电建水电开发公司专题调研毛尔盖水电站经营情况，指导企业解决电站经营困难问题。\",\n" +
        "                \"date\": \"发布时间：2020/07/17\",\n" +
        "                \"image\": \"https://dimg05.c-ctrip.com/images/100j090000003p8412A22_C_750_375.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"1\",\n" +
        "                \"title\": \"宁夏：主动作为担责任  强化措施抓落实\",\n" +
        "                \"content\": \"　　今年是全国节能宣传周举办30周年，也是检验各地“十三五”节能工作成效的收官之年，宁夏始终将节能工作作为优化经济结构、加快生态文明建设的重要抓手，经济发展、社会进步与绿色低碳、循环发展逐渐展现了相互促进的良性发展轨迹。\",\n" +
        "                \"date\": \"发布时间：2020/06/27\",\n" +
        "                \"image\": \"https://x0.ifengimg.com/ucms/2020_21/B7EDAB31418A68094E839BC00E0655B4EED26E65_w1080_h1620.jpg\"\n" +
        "            },\n" +
        "            {\n" +
        "                \"id\": \"2\",\n" +
        "                \"title\": \"四川省发展改革委调研组专题调研毛尔盖水电站经营情况\",\n" +
        "                \"content\": \"7月10日，省发展改革委副主任、省能源局局长梁武湖，率领省发展改革委、省能源局有关处室负责同志深入中电建水电开发公司专题调研毛尔盖水电站经营情况，指导企业解决电站经营困难问题。\",\n" +
        "                \"date\": \"发布时间：2020/07/17\",\n" +
        "                \"image\": \"https://dimg05.c-ctrip.com/images/100j090000003p8412A22_C_750_375.jpg\"\n" +
        "            }\n" +
        "        ],\n" +
        "        \"searchWord\": \"发展\",\n" +
        "        \"pageNumber\": 1,\n" +
        "        \"hasMore\": true\n" +
        "    },\n" +
        "    \"status\": 200,\n" +
        "    \"msg\": \"OK\"\n" +
        "}"
  }

  override fun getStrategy() = DataStrategy.NET_GET_ONLY

  override fun getNetData(
    param: SearchPagingRequest?,
    callBack: RepositoryCallback<BaseResponse<ArticlePagingBean>>?
  ) {
    val type = object : TypeToken<BaseResponse<ArticlePagingBean>>() {}.type
    val response = GsonUtil.getGsonObj<BaseResponse<ArticlePagingBean>>(TEST_JSON, type)
    callBack?.onSuccess(response)
    /*param?.let {
      NetManager.getApi(AbstractApi::class.java)
        .getSearchArticleList(it.searchWord, it.pageNumber, it.pageSize)
        .observeOn(AndroidSchedulers.mainThread())
        .subscribeOn(Schedulers.io())
        .subscribe({ response ->
          if(response.isSuccessful){
            callBack?.onSuccess(response)
          } else {
            callBack?.onFailure(response.status, response.msg)
          }
        }, { throwable ->
          callBack?.onError(throwable)
        })
    }*/
  }
}